In [1]:
import pandas as pd

In [146]:
sales_data = {
    'Order ID': [10001, 10002, 10003, 10004, 10005, 10006],
    'Product': ['Laptop', 'Mouse', 'Monitor', 'Keyboard', 'Headset', 'Laptop'],
    'Quantity Ordered': [1, 2, 1, 3, 2, 1],
    'Price Each': [1200.00, 25.00, 200.00, 75.00, 50.00, 1200.00],
    'Order Date': ['2023-07-01 10:00:00', '2023-07-01 11:00:00', '2023-07-01 12:00:00', '2023-07-02 09:00:00', '2023-07-02 10:00:00', '2023-07-03 08:00:00'],
    'Purchase Address': ['123 Elm St, New York, NY 10001',
                        '456 Oak St, San Francisco, CA 94107',
                         '789 Maple St, Los Angeles, CA 90001',
                         '101 Pine St, Seattle, WA 98101',
                         '202 Birch St, Boston, MA 02115',
                         '123 Elm St, New York, NY 10001'
                        ]
}
df=pd.DataFrame(sales_data)
df

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,10001,Laptop,1,1200.0,2023-07-01 10:00:00,"123 Elm St, New York, NY 10001"
1,10002,Mouse,2,25.0,2023-07-01 11:00:00,"456 Oak St, San Francisco, CA 94107"
2,10003,Monitor,1,200.0,2023-07-01 12:00:00,"789 Maple St, Los Angeles, CA 90001"
3,10004,Keyboard,3,75.0,2023-07-02 09:00:00,"101 Pine St, Seattle, WA 98101"
4,10005,Headset,2,50.0,2023-07-02 10:00:00,"202 Birch St, Boston, MA 02115"
5,10006,Laptop,1,1200.0,2023-07-03 08:00:00,"123 Elm St, New York, NY 10001"

1.DISPLAY TOP 3 ROWS OF THE DATASET

In [148]:
df.head(3) # head is used for display the above data on the dataset

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,10001,Laptop,1,1200.0,2023-07-01 10:00:00,"123 Elm St, New York, NY 10001"
1,10002,Mouse,2,25.0,2023-07-01 11:00:00,"456 Oak St, San Francisco, CA 94107"
2,10003,Monitor,1,200.0,2023-07-01 12:00:00,"789 Maple St, Los Angeles, CA 90001"

2.CHECK LAST 3 ROWS OF THE DATASET

In [150]:
df.tail(3)  # tail is used to display the below the data of dataset

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
3,10004,Keyboard,3,75.0,2023-07-02 09:00:00,"101 Pine St, Seattle, WA 98101"
4,10005,Headset,2,50.0,2023-07-02 10:00:00,"202 Birch St, Boston, MA 02115"
5,10006,Laptop,1,1200.0,2023-07-03 08:00:00,"123 Elm St, New York, NY 10001"

3. FIND SHAPE OF OUR DATASET (NUMBER OF ROWS AND NUMBER OF COLUMS)

In [152]:
df.shape # shape is a attribute in the pandas which is used to count the rows and columns in dataset

(6, 6)

In [154]:
print('Total number of rows',df.shape[0])
print('Total number of columns',df.shape[1])

Total number of rows 6
Total number of columns 6

4.GET INFORMATION ABOUT OUR DATASET LIKE TOTAL NUMBER ROWS, TOTAL NUMBER OF COLUMNS, DATASET OF EACH COLUMN AND MEMORY REQUIREMENT

In [156]:
df.info()  #info() method is used to get the all information about dataset like - No. of Rows and Columns,datatypes,colums names,No.of Null Value of each columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          6 non-null      int64
 1   Product           6 non-null      object
 2   Quantity Ordered  6 non-null      int64
 3   Price Each        6 non-null      float64
 4   Order Date        6 non-null      object
 5   Purchase Address  6 non-null      object
dtypes: float64(1), int64(2), object(3)
memory usage: 420.0+ bytes

5. CHECK NULL VALUES IN THE DATASET

In [158]:
    df.isnull() # isnull() method is used to find the null value in dataset. It display the True and False value in the dataset , True is used for Null value and False is used for Not Null value

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
5,False,False,False,False,False,False

6.CHECK TOTAL NULLL VALUES IN THE DATASET OF EACH COLUMNS

In [160]:
df.isnull().sum() # sum count the total number of null value in the dataset

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

7.GET OVERALL STATISTICS ABOUT THE DATASET

In [162]:
df.describe()  # The descibe() method is used to display default- Only float and integer value columns of statistics calculation in dataset

           Order ID  Quantity Ordered   Price Each
count      6.000000          6.000000     6.000000
mean   10003.500000          1.666667   458.333333
std        1.870829          0.816497   577.638872
min    10001.000000          1.000000    25.000000
25%    10002.250000          1.000000    56.250000
50%    10003.500000          1.500000   137.500000
75%    10004.750000          2.000000   950.000000
max    10006.000000          3.000000  1200.000000

In [164]:
df.describe(include='all') # The [include = all] will be include all columns whether it is strings and display the statistics calculation

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,6.000000,6,6.000000,6.000000,6,6
unique,NaN,5,NaN,NaN,6,5
top,NaN,Laptop,NaN,NaN,2023-07-01 10:00:00,"123 Elm St, New York, NY 10001"
freq,NaN,2,NaN,NaN,1,2
mean,10003.500000,NaN,1.666667,458.333333,NaN,NaN
std,1.870829,NaN,0.816497,577.638872,NaN,NaN
min,10001.000000,NaN,1.000000,25.000000,NaN,NaN
25%,10002.250000,NaN,1.000000,56.250000,NaN,NaN
50%,10003.500000,NaN,1.500000,137.500000,NaN,NaN
75%,10004.750000,NaN,2.000000,950.000000,NaN,NaN
max,10006.000000,NaN,3.000000,1200.000000,NaN,NaN

8. FIND THE UNIQUE VALUE IN THE COULUMS OF QUANTITY ORDERED

In [166]:
df['Quantity Ordered'].unique() # This method is very useful when you want to identify all the distinct or same elements present in your data.

array([1, 2, 3], dtype=int64)

In [168]:
df['Quantity Ordered'].nunique()  #It can be particularly useful for summarizing data to understand the number of distinct or same values present.

3

In [170]:
df['Quantity Ordered'].value_counts()  # display the counts of unique value in Quantity Ordered columns
# df['Product'].value_counts() #just for example

Quantity Ordered
1    3
2    2
3    1
Name: count, dtype: int64

9. FIND TOTAL NUMBER OF PRODUCT HAVING PRICE BETWEEN 1000 TO 1500 USING METHOD

In [172]:
print('There are ', len(df[(df['Price Each']>=1000) & (df['Price Each']<=1500)]),' Rows who contain the price between 1000 to 1500')

There are  2  Rows who contain the price between 1000 to 1500

In [174]:
sum(df['Price Each'].between(1000,1500))

2

10. FIND THE AVERAGE OF PRICE

In [176]:
df['Price Each'].mean()

458.3333333333333

DROP THE ORDER DATE & PURCHASE ADDRESS COLUMN

In [180]:
df.drop(['Order Date','Purchase Address'],axis=1,inplace=True)

In [182]:
df

   Order ID   Product  Quantity Ordered  Price Each
0     10001    Laptop                 1      1200.0
1     10002     Mouse                 2        25.0
2     10003   Monitor                 1       200.0
3     10004  Keyboard                 3        75.0
4     10005   Headset                 2        50.0
5     10006    Laptop                 1      1200.0

PRINT NAME OF THE COLUMNS

In [185]:
df.columns

Index(['Order ID', 'Product', 'Quantity Ordered', 'Price Each'], dtype='object')

In [187]:
df.index

RangeIndex(start=0, stop=6, step=1)

SORT THE DATAFRAME AS PER THE PRICE

In [191]:
 df.sort_values(by='Price Each',ascending=True)  #Ascending Order

   Order ID   Product  Quantity Ordered  Price Each
1     10002     Mouse                 2        25.0
4     10005   Headset                 2        50.0
3     10004  Keyboard                 3        75.0
2     10003   Monitor                 1       200.0
0     10001    Laptop                 1      1200.0
5     10006    Laptop                 1      1200.0

In [195]:
 df.sort_values(by=['Price Each','Order ID'],ascending=False)  #Descending Order

   Order ID   Product  Quantity Ordered  Price Each
5     10006    Laptop                 1      1200.0
0     10001    Laptop                 1      1200.0
2     10003   Monitor                 1       200.0
3     10004  Keyboard                 3        75.0
4     10005   Headset                 2        50.0
1     10002     Mouse                 2        25.0

DISPLAY THE ORDER ID AND PRICE OF LAPTOP ONLY

In [205]:
df[df['Product']=='Laptop'][['Order ID', 'Price Each']]

   Order ID  Price Each
0     10001      1200.0
5     10006      1200.0